<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted'             => 'У :атрибут би требало да буде усвојен.',
    'active_url'           => 'У :атрибут-то није ваљан URL.',
    'after'                => 'У :атрибут мора бити после датума :Датум.',
    'alpha'                => 'У :атрибут може да садржи само слова.',
    'alpha_dash'           => 'У :атрибут може да садржи само слова, бројеве и цртице.',
    'alpha_num'            => 'У :атрибут може да садржи само слова и бројеве.',
    'array'                => 'У :атрибут мора бити низ.',
    'before'               => 'У :атрибут мора да буде касније од датума :Датум.',
    'between'              => [
        'numeric' => 'У :атрибут мора да буде између мин и Макс.',
        'file'    => 'У :атрибут мора да буде између :мин :макс килобајта.',
        'string'  => 'У :атрибут мора да буде између :мин :макс. број симбола.',
        'array'   => 'У :атрибут мора да има између :мин :макс елемената.',
    ],
    'boolean'              => 'У поље атрибут мора да има вредност True или false.',
    'confirmed'            => 'У :потврда атрибута се не поклапа.',
    'date'                 => 'У :атрибут није дозвољена датумом.',
    'date_format'          => 'У :атрибут не одговара формат :Формат.',
    'different'            => 'У :атрибут и :других требало да буде другачије.',
    'digits'               => 'У :атрибут мора да буде :бројеви бројеви.',
    'digits_between'       => 'У :атрибут мора да буде између :мин :макс цифара.',
    'distinct'             => 'У поље атрибута има дуплиране вредности.',
    'email'                => 'У :атрибут мора бити важећа адреса е-поште.',
    'exists'               => 'Неке :атрибут је неважећи.',
    'filled'               => 'Потребно :поље атрибута.',
    'image'                => 'У :атрибут мора да буде начин.',
    'in'                   => 'Неке :атрибут је неважећи.',
    'in_array'             => 'У поље атрибута не постоји :други.',
    'integer'              => 'У :атрибут мора бити цео број.',
    'ip'                   => 'У :атрибут мора да буде важећу IP адресу.',
    'json'                 => 'У :атрибут мора да буде валидан јсон-линију.',
    'max'                  => [
        'numeric' => 'У :атрибут не може бити већи од :Макс.',
        'file'    => 'У :атрибут не може бити већи од :максимално килобајта.',
        'string'  => 'У :атрибут не може бити већи од :максимално карактера.',
        'array'   => 'У :атрибут не може имати више од :максимално предмета.',
    ],
    'mimes'                => 'У :атрибут мора да буде фајл типа: :вредности.',
    'min'                  => [
        'numeric' => 'У :атрибут мора бити најмање :мин.',
        'file'    => 'У :атрибут мора бити најмање :мин. килобајта.',
        'string'  => 'У :атрибут мора бити најмање :мин ликове.',
        'array'   => 'У :атрибут мора имати минимум :најмање предмета.',
    ],
    'not_in'               => 'Неке :атрибут је неважећи.',
    'numeric'              => 'У :атрибут мора да буде у близини.',
    'present'              => 'У поље атрибут мора да буде присутан.',
    'regex'                => 'У :формат атрибут је неважећи.',
    'required'             => 'Потребно :поље атрибута.',
    'required_if'          => 'У поље атрибут је обавезан ако :друго :вредности.',
    'required_unless'      => 'У поље атрибут је обавезан ако :остале вредности.',
    'required_with'        => 'У поље атрибут је обавезан ако :вредности присутан.',
    'required_with_all'    => 'У поље атрибут је обавезан ако :вредности присутан.',
    'required_without'     => 'У поље атрибут је обавезан ако :вредности бр.',
    'required_without_all' => 'У поље атрибут обавезно, ако ни један од :вредности су присутни.',
    'same'                 => 'У :атрибут и :други треба да се поклопи.',
    'size'                 => [
        'numeric' => 'У :атрибут мора да буде :Величина.',
        'file'    => 'У :атрибут мора да буде :Величину килобајта.',
        'string'  => 'У :атрибут мора да буде :величине знакова.',
        'array'   => 'У :атрибут мора да садржи :Величина елемената.',
    ],
    'string'               => 'У :атрибут мора да буде ниска.',
    'timezone'             => 'У :атрибут мора да буде у зони дозвољене.',
    'unique'               => 'У :атрибут већ донета.',
    'url'                  => 'У :формат атрибут је неважећи.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'обичај поруку',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [],

];
