<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted'             => 'В :атрибут повинен бути прийнятий.',
    'active_url'           => 'В :атрибут-це не дійсний URL-адресу.',
    'after'                => 'В :атрибут повинен бути після дати :Дата.',
    'alpha'                => 'В :атрибут може містити тільки літери.',
    'alpha_dash'           => 'В :атрибут може містити тільки літери, цифри і тире.',
    'alpha_num'            => 'В :атрибут може містити тільки літери та цифри.',
    'array'                => 'В :атрибут повинен бути масивом.',
    'before'               => 'В :атрибут повинен бути пізніше дати :Дата.',
    'between'              => [
        'numeric' => 'В :атрибут повинен бути між min і max.',
        'file'    => 'В :атрибут повинен бути між :мін :макс кілобайт.',
        'string'  => 'В :атрибут повинен бути між :мін :макс. число символів.',
        'array'   => 'В :атрибут повинен мати між :мін :макс елементів.',
    ],
    'boolean'              => 'У полі атрибут повинен мати значення True або false.',
    'confirmed'            => 'В :підтвердження атрибута не збігається.',
    'date'                 => 'В :атрибут не є припустимою датою.',
    'date_format'          => 'В :атрибут не відповідає формату у Формат.',
    'different'            => 'В :атрибут і :інших повинно бути інакше.',
    'digits'               => 'В :атрибут повинен бути :цифри цифри.',
    'digits_between'       => 'В :атрибут повинен бути між :мін :макс цифр.',
    'distinct'             => 'В поле атрибута має повторювані значення.',
    'email'                => 'В :атрибут повинен бути дійсний адресу електронної пошти.',
    'exists'               => 'Деякі :атрибут є недійсним.',
    'filled'               => 'Вимагається :поле атрибута.',
    'image'                => 'В :атрибут повинен бути образ.',
    'in'                   => 'Деякі :атрибут є недійсним.',
    'in_array'             => 'В поле атрибута не існує :інші.',
    'integer'              => 'В :атрибут повинен бути цілим числом.',
    'ip'                   => 'В :атрибут повинен бути дійсний IP-адресу.',
    'json'                 => 'В :атрибут повинен бути допустимим json-рядок.',
    'max'                  => [
        'numeric' => 'В :атрибут не може бути більше, ніж :Макс.',
        'file'    => 'В :атрибут не може бути більше, ніж максимум кілобайт.',
        'string'  => 'В :атрибут не може бути більше, ніж максимум персонажів.',
        'array'   => 'В :атрибут не може мати більше ніж :максимум предметів.',
    ],
    'mimes'                => 'В :атрибут повинен бути файл типу: :цінностей.',
    'min'                  => [
        'numeric' => 'В :атрибут повинен бути не менше :хв.',
        'file'    => 'В :атрибут повинен бути не менше :хв. кілобайт.',
        'string'  => 'В :атрибут повинен бути не менше :min характери.',
        'array'   => 'В :атрибут повинен мати як мінімум :мінімум предметів.',
    ],
    'not_in'               => 'Деякі :атрибут є недійсним.',
    'numeric'              => 'В :атрибут повинен бути поруч.',
    'present'              => 'У полі атрибут повинен бути присутнім.',
    'regex'                => 'В :формат атрибут є недійсним.',
    'required'             => 'Вимагається :поле атрибута.',
    'required_if'          => 'У полі атрибут є обов\'язковим, якщо :інше значення.',
    'required_unless'      => 'У полі атрибут є обов\'язковим, якщо :інші значення.',
    'required_with'        => 'У полі атрибут є обов\'язковим, якщо :значення присутній.',
    'required_with_all'    => 'У полі атрибут є обов\'язковим, якщо :значення присутній.',
    'required_without'     => 'У полі атрибут є обов\'язковим, якщо :значення немає.',
    'required_without_all' => 'У полі атрибут є обов\'язковим, якщо жоден з :значення присутні.',
    'same'                 => 'В :атрибут і :інших повинно збігатися.',
    'size'                 => [
        'numeric' => 'В :атрибут повинен бути :Розмір.',
        'file'    => 'В :атрибут повинен бути :Розмір кілобайт.',
        'string'  => 'В :атрибут повинен бути :розміром символів.',
        'array'   => 'В :атрибут повинен містити :Розмір елементів.',
    ],
    'string'               => 'В :атрибут повинен бути рядком.',
    'timezone'             => 'В :атрибут повинен бути в допустимій зоні.',
    'unique'               => 'В :атрибут вже прийнято.',
    'url'                  => 'В :формат атрибут є недійсним.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'на замовлення повідомлення',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [],

];
